[
  {
    "title": "WebVPython WASM Runner",
    "desc": "I built a WebVPython runner using Pyodide and WebAssembly (WASM) that serves interactive Python directly in the browser. I focused on handling message communication between iframes, enabling dynamic imports of Python modules, and validating user input to create a safe and responsive environment.",
    "tags": ["JavaScript", "WASM", "Pyodide", "Docker"],
    "link": "https://github.com/vpython/wmWVPRunner",
    "date": "2023-12-04"
  },
  {
    "title": "Bluetooth Attendance Application",
    "desc": "I developed a Python tool that automatically tracks attendance by detecting students' devices via Bluetooth MAC addresses. I added an exporter that writes attendance records to CSV files and ensured the program runs smoothly with multi-threading for simultaneous detection and logging.",
    "tags": ["Python", "Threads", "CSV"],
    "link": "https://github.com/c4snipes/BluetoothAttendanceApplication",
    "date": "2025-06-01"
  },
  {
    "title": "Budget Manager",
    "desc": "I created a command-line budget manager in Rust that tracks expenses and income. I implemented structured data storage, efficient parsing of user input, and reporting features to help manage personal finances via a simple terminal interface.",
    "tags": ["Rust", "CLI"],
    "link": "https://github.com/c4snipes/budget_manager",
    "date": "2025-05-20"
  },
  {
    "title": "Obesity Risk Prediction",
    "desc": "I designed an obesity risk prediction pipeline by applying machine learning models—including logistic regression, decision trees, and random forests—to lifestyle and health data. I handled data preprocessing, trained and evaluated the models, and produced visualizations that communicate the performance and insights.",
    "tags": ["Python", "Pandas", "ML"],
    "link": "https://colab.research.google.com/drive/1KPU3XLnK4sVZgeRYdM17scwT8PfMw7gl?usp=sharing#scrollTo=y9NdIp0NHKW-",
    "date": "2024-11-10"
  },
  {
    "title": "Password Manager Testing",
    "desc": "I built an automated test suite using Selenium for a collaborative password manager. I wrote end-to-end tests that simulate user actions like creating, sharing, and retrieving passwords, and integrated the suite into a continuous integration pipeline to ensure stability.",
    "tags": ["Python", "Selenium", "CI"],
    "link": "https://github.com/c4snipes/swen320_2024S_password_manager_EllerSnipes_automatictesting",
    "date": "2024-04-15"
  },
  {
    "title": "Spring Boot Showcase",
    "desc": "I learned Spring Boot by creating a simple REST API. I configured controllers, services, and repositories to handle CRUD operations, experimented with dependency injection, and kept the configuration minimal to understand the framework’s defaults.",
    "tags": ["Java", "Spring Boot", "REST"],
    "link": "https://github.com/c4snipes/gs-spring-boot",
    "date": "2024-03-01"
  },
  {
    "title": "Portfolio Website",
    "desc": "I designed and implemented this portfolio website from scratch. I focused on responsive layout, dynamic data loading from JSON files, search and filter functionality, and theme toggling between light and dark modes to provide a polished user experience.",
    "tags": ["HTML", "CSS", "JavaScript"],
    "link": "https://github.com/c4snipes/ColeSnipesPortfolio",
    "date": "2025-09-05"
  }
]
